; domain
;; source: https://github.com/AI-Planning/pddl-generators/blob/main/rovers/domain.pddl
;; updates:
;;   - since actions are performed sequentially and immediately
;;     'channel_free' and 'available' predicates are removed
;;   -

(define (domain rover)
(:requirements :strips :typing)
(:types rover waypoint store camera mode lander objective)

(:predicates
    (at ?x - rover ?y - waypoint)
    (at_lander ?x - lander ?y - waypoint)
    (can_traverse ?r - rover ?x - waypoint ?y - waypoint)
	(equipped_for_soil_analysis ?r - rover)
    (equipped_for_rock_analysis ?r - rover)
    (equipped_for_imaging ?r - rover)
    (empty ?s - store)
    (have_rock_analysis ?r - rover ?w - waypoint)
    (have_soil_analysis ?r - rover ?w - waypoint)
    (full ?s - store)
	(calibrated ?c - camera ?r - rover)
	(supports ?c - camera ?m - mode)
    (visible ?w - waypoint ?p - waypoint)
    (have_image ?r - rover ?o - objective ?m - mode)
    (communicated_soil_data ?w - waypoint)
    (communicated_rock_data ?w - waypoint)
    (communicated_image_data ?o - objective ?m - mode)
	(at_soil_sample ?w - waypoint)
	(at_rock_sample ?w - waypoint)
    (visible_from ?o - objective ?w - waypoint)
	(store_of ?s - store ?r - rover)
	(calibration_target ?i - camera ?o - objective)
	(on_board ?i - camera ?r - rover)
)

(:action navigate
:parameters (?x - rover ?y - waypoint ?z - waypoint)
:precondition (and
    (can_traverse ?x ?y ?z)
    (at ?x ?y)
    (visible ?y ?z))
:effect (and
    (not (at ?x ?y))
    (at ?x ?z))
)

(:action sample_soil
:parameters (?x - rover ?s - store ?p - waypoint)
:precondition (and
    (at ?x ?p)
    (at_soil_sample ?p)
	(equipped_for_soil_analysis ?x)
	(store_of ?s ?x)
	(empty ?s))
:effect (and
    (not (empty ?s))
    (full ?s)
    (have_soil_analysis ?x ?p)
    (not (at_soil_sample ?p)))
)

(:action sample_rock
:parameters (?x - rover ?s - store ?p - waypoint)
:precondition (and
    (at ?x ?p)
    (at_rock_sample ?p)
	(equipped_for_rock_analysis ?x)
	(store_of ?s ?x)
	(empty ?s))
:effect (and
    (not (empty ?s))
    (full ?s)
    (have_rock_analysis ?x ?p)
	(not (at_rock_sample ?p)))
)

(:action drop
:parameters (?x - rover ?y - store)
:precondition (and
    (store_of ?y ?x)
    (full ?y))
:effect (and
    (not (full ?y))
    (empty ?y))
)

(:action calibrate
 :parameters (?r - rover ?i - camera ?t - objective ?w - waypoint)
 :precondition (and
    (equipped_for_imaging ?r)
    (calibration_target ?i ?t)
    (at ?r ?w)
    (visible_from ?t ?w)
    (on_board ?i ?r))
 :effect (and
    (calibrated ?i ?r))
)

(:action take_image
 :parameters (?r - rover ?p - waypoint ?o - objective ?i - camera ?m - mode)
 :precondition (and
    (calibrated ?i ?r)
    (on_board ?i ?r)
    (equipped_for_imaging ?r)
    (supports ?i ?m)
    (visible_from ?o ?p)
    (at ?r ?p))
 :effect (and
    (have_image ?r ?o ?m)
    (not (calibrated ?i ?r)))
)

(:action communicate_soil_data
 :parameters (?r - rover ?l - lander ?p - waypoint ?x - waypoint ?y - waypoint)
 :precondition (and
    (at ?r ?x)
    (at_lander ?l ?y)
    (have_soil_analysis ?r ?p)
    (visible ?x ?y))
 :effect (and
    (communicated_soil_data ?p))
)

(:action communicate_rock_data
 :parameters (?r - rover ?l - lander ?p - waypoint ?x - waypoint ?y - waypoint)
 :precondition (and
    (at ?r ?x)
    (at_lander ?l ?y)
    (have_rock_analysis ?r ?p)
    (visible ?x ?y))
 :effect (and
    (communicated_rock_data ?p))
)

(:action communicate_image_data
 :parameters (?r - rover ?l - lander ?o - objective ?m - mode
	      ?x - waypoint ?y - waypoint)
 :precondition (and
    (at ?r ?x)
    (at_lander ?l ?y)
    (have_image ?r ?o ?m)
    (visible ?x ?y))
 :effect (and
    (communicated_image_data ?o ?m)))
)

; problem
;; rovers=4, waypoints=10, cameras=4, objectives=10, out_folder=training/easy, instance_id=91, seed=126

(define (problem rover-91)
 (:domain rover)
 (:objects 
    general - lander
    colour high_res low_res - mode
    rover1 rover2 rover3 rover4 - rover
    rover1store rover2store rover3store rover4store - store
    waypoint1 waypoint2 waypoint3 waypoint4 waypoint5 waypoint6 waypoint7 waypoint8 waypoint9 waypoint10 - waypoint
    camera1 camera2 camera3 camera4 - camera
    objective1 objective2 objective3 objective4 objective5 objective6 objective7 objective8 objective9 objective10 - objective)
 (:init 
    (at_lander general waypoint10)
    (at rover1 waypoint1)
    (at rover2 waypoint10)
    (at rover3 waypoint10)
    (at rover4 waypoint8)
    (equipped_for_soil_analysis rover4)
    (equipped_for_soil_analysis rover1)
    (equipped_for_soil_analysis rover3)
    (equipped_for_soil_analysis rover2)
    (equipped_for_rock_analysis rover1)
    (equipped_for_rock_analysis rover3)
    (equipped_for_imaging rover4)
    (equipped_for_imaging rover3)
    (empty rover1store)
    (empty rover2store)
    (empty rover3store)
    (empty rover4store)
    (store_of rover1store rover1)
    (store_of rover2store rover2)
    (store_of rover3store rover3)
    (store_of rover4store rover4)
    (at_rock_sample waypoint2)
    (at_rock_sample waypoint5)
    (at_soil_sample waypoint1)
    (at_soil_sample waypoint2)
    (at_soil_sample waypoint4)
    (at_soil_sample waypoint5)
    (at_soil_sample waypoint6)
    (at_soil_sample waypoint9)
    (visible waypoint9 waypoint10)
    (visible waypoint3 waypoint8)
    (visible waypoint6 waypoint2)
    (visible waypoint10 waypoint9)
    (visible waypoint3 waypoint1)
    (visible waypoint3 waypoint7)
    (visible waypoint5 waypoint4)
    (visible waypoint7 waypoint3)
    (visible waypoint9 waypoint5)
    (visible waypoint8 waypoint3)
    (visible waypoint4 waypoint5)
    (visible waypoint10 waypoint6)
    (visible waypoint6 waypoint10)
    (visible waypoint2 waypoint6)
    (visible waypoint5 waypoint3)
    (visible waypoint5 waypoint9)
    (visible waypoint1 waypoint3)
    (visible waypoint3 waypoint5)
    (visible waypoint1 waypoint6)
    (visible waypoint6 waypoint1)
    (visible waypoint6 waypoint8)
    (visible waypoint8 waypoint6)
    (visible waypoint3 waypoint9)
    (visible waypoint9 waypoint3)
    (visible waypoint4 waypoint6)
    (visible waypoint6 waypoint4)
    (visible waypoint7 waypoint8)
    (visible waypoint8 waypoint7)
    (visible waypoint2 waypoint4)
    (visible waypoint4 waypoint2)
    (visible waypoint2 waypoint10)
    (visible waypoint10 waypoint2)
    (visible waypoint1 waypoint10)
    (visible waypoint10 waypoint1)
    (visible waypoint2 waypoint5)
    (visible waypoint5 waypoint2)
    (visible waypoint2 waypoint3)
    (visible waypoint3 waypoint2)
    (visible waypoint5 waypoint10)
    (visible waypoint10 waypoint5)
    (visible waypoint2 waypoint9)
    (visible waypoint9 waypoint2)
    (visible waypoint1 waypoint9)
    (visible waypoint9 waypoint1)
    (visible waypoint8 waypoint10)
    (visible waypoint10 waypoint8)
    (visible waypoint2 waypoint8)
    (visible waypoint8 waypoint2)
    (visible waypoint1 waypoint5)
    (visible waypoint5 waypoint1)
    (visible waypoint4 waypoint10)
    (visible waypoint10 waypoint4)
    (visible waypoint3 waypoint10)
    (visible waypoint10 waypoint3)
    (visible waypoint1 waypoint8)
    (visible waypoint8 waypoint1)
    (visible waypoint5 waypoint6)
    (visible waypoint6 waypoint5)
    (visible waypoint1 waypoint7)
    (visible waypoint7 waypoint1)
    (visible waypoint4 waypoint8)
    (visible waypoint8 waypoint4)
    (visible waypoint3 waypoint4)
    (visible waypoint4 waypoint3)
    (visible waypoint1 waypoint2)
    (visible waypoint2 waypoint1)
    (visible waypoint8 waypoint9)
    (visible waypoint9 waypoint8)
    (visible waypoint6 waypoint9)
    (visible waypoint9 waypoint6)
    (visible waypoint2 waypoint7)
    (visible waypoint7 waypoint2)
    (visible waypoint1 waypoint4)
    (visible waypoint4 waypoint1)
    (visible waypoint4 waypoint9)
    (visible waypoint9 waypoint4)
    (visible waypoint7 waypoint9)
    (visible waypoint9 waypoint7)
    (visible waypoint5 waypoint7)
    (visible waypoint7 waypoint5)
    (can_traverse rover1 waypoint9 waypoint10)
    (can_traverse rover1 waypoint3 waypoint8)
    (can_traverse rover1 waypoint6 waypoint2)
    (can_traverse rover1 waypoint10 waypoint9)
    (can_traverse rover1 waypoint3 waypoint1)
    (can_traverse rover1 waypoint3 waypoint7)
    (can_traverse rover1 waypoint5 waypoint4)
    (can_traverse rover1 waypoint7 waypoint3)
    (can_traverse rover1 waypoint9 waypoint5)
    (can_traverse rover1 waypoint8 waypoint3)
    (can_traverse rover1 waypoint4 waypoint5)
    (can_traverse rover1 waypoint10 waypoint6)
    (can_traverse rover1 waypoint6 waypoint10)
    (can_traverse rover1 waypoint2 waypoint6)
    (can_traverse rover1 waypoint5 waypoint3)
    (can_traverse rover1 waypoint5 waypoint9)
    (can_traverse rover1 waypoint1 waypoint3)
    (can_traverse rover1 waypoint3 waypoint5)
    (can_traverse rover1 waypoint1 waypoint6)
    (can_traverse rover1 waypoint6 waypoint1)
    (can_traverse rover1 waypoint2 waypoint9)
    (can_traverse rover1 waypoint9 waypoint2)
    (can_traverse rover1 waypoint1 waypoint7)
    (can_traverse rover1 waypoint7 waypoint1)
    (can_traverse rover2 waypoint9 waypoint10)
    (can_traverse rover2 waypoint3 waypoint8)
    (can_traverse rover2 waypoint6 waypoint2)
    (can_traverse rover2 waypoint10 waypoint9)
    (can_traverse rover2 waypoint3 waypoint1)
    (can_traverse rover2 waypoint3 waypoint7)
    (can_traverse rover2 waypoint5 waypoint4)
    (can_traverse rover2 waypoint7 waypoint3)
    (can_traverse rover2 waypoint9 waypoint5)
    (can_traverse rover2 waypoint8 waypoint3)
    (can_traverse rover2 waypoint4 waypoint5)
    (can_traverse rover2 waypoint10 waypoint6)
    (can_traverse rover2 waypoint6 waypoint10)
    (can_traverse rover2 waypoint2 waypoint6)
    (can_traverse rover2 waypoint5 waypoint3)
    (can_traverse rover2 waypoint5 waypoint9)
    (can_traverse rover2 waypoint1 waypoint3)
    (can_traverse rover2 waypoint3 waypoint5)
    (can_traverse rover2 waypoint3 waypoint9)
    (can_traverse rover2 waypoint9 waypoint3)
    (can_traverse rover2 waypoint7 waypoint8)
    (can_traverse rover2 waypoint8 waypoint7)
    (can_traverse rover2 waypoint2 waypoint10)
    (can_traverse rover2 waypoint10 waypoint2)
    (can_traverse rover2 waypoint2 waypoint5)
    (can_traverse rover2 waypoint5 waypoint2)
    (can_traverse rover2 waypoint2 waypoint3)
    (can_traverse rover2 waypoint3 waypoint2)
    (can_traverse rover2 waypoint5 waypoint10)
    (can_traverse rover2 waypoint10 waypoint5)
    (can_traverse rover2 waypoint2 waypoint9)
    (can_traverse rover2 waypoint9 waypoint2)
    (can_traverse rover2 waypoint2 waypoint8)
    (can_traverse rover2 waypoint8 waypoint2)
    (can_traverse rover2 waypoint4 waypoint8)
    (can_traverse rover2 waypoint8 waypoint4)
    (can_traverse rover2 waypoint3 waypoint4)
    (can_traverse rover2 waypoint4 waypoint3)
    (can_traverse rover2 waypoint1 waypoint2)
    (can_traverse rover2 waypoint2 waypoint1)
    (can_traverse rover2 waypoint1 waypoint4)
    (can_traverse rover2 waypoint4 waypoint1)
    (can_traverse rover3 waypoint9 waypoint10)
    (can_traverse rover3 waypoint3 waypoint8)
    (can_traverse rover3 waypoint6 waypoint2)
    (can_traverse rover3 waypoint10 waypoint9)
    (can_traverse rover3 waypoint3 waypoint1)
    (can_traverse rover3 waypoint3 waypoint7)
    (can_traverse rover3 waypoint5 waypoint4)
    (can_traverse rover3 waypoint7 waypoint3)
    (can_traverse rover3 waypoint9 waypoint5)
    (can_traverse rover3 waypoint8 waypoint3)
    (can_traverse rover3 waypoint4 waypoint5)
    (can_traverse rover3 waypoint10 waypoint6)
    (can_traverse rover3 waypoint6 waypoint10)
    (can_traverse rover3 waypoint2 waypoint6)
    (can_traverse rover3 waypoint5 waypoint3)
    (can_traverse rover3 waypoint5 waypoint9)
    (can_traverse rover3 waypoint1 waypoint3)
    (can_traverse rover3 waypoint3 waypoint5)
    (can_traverse rover3 waypoint7 waypoint8)
    (can_traverse rover3 waypoint8 waypoint7)
    (can_traverse rover3 waypoint2 waypoint4)
    (can_traverse rover3 waypoint4 waypoint2)
    (can_traverse rover3 waypoint2 waypoint10)
    (can_traverse rover3 waypoint10 waypoint2)
    (can_traverse rover3 waypoint2 waypoint3)
    (can_traverse rover3 waypoint3 waypoint2)
    (can_traverse rover3 waypoint5 waypoint10)
    (can_traverse rover3 waypoint10 waypoint5)
    (can_traverse rover3 waypoint1 waypoint5)
    (can_traverse rover3 waypoint5 waypoint1)
    (can_traverse rover3 waypoint3 waypoint10)
    (can_traverse rover3 waypoint10 waypoint3)
    (can_traverse rover3 waypoint1 waypoint7)
    (can_traverse rover3 waypoint7 waypoint1)
    (can_traverse rover3 waypoint2 waypoint7)
    (can_traverse rover3 waypoint7 waypoint2)
    (can_traverse rover3 waypoint1 waypoint4)
    (can_traverse rover3 waypoint4 waypoint1)
    (can_traverse rover3 waypoint4 waypoint9)
    (can_traverse rover3 waypoint9 waypoint4)
    (can_traverse rover4 waypoint9 waypoint10)
    (can_traverse rover4 waypoint3 waypoint8)
    (can_traverse rover4 waypoint6 waypoint2)
    (can_traverse rover4 waypoint10 waypoint9)
    (can_traverse rover4 waypoint3 waypoint1)
    (can_traverse rover4 waypoint3 waypoint7)
    (can_traverse rover4 waypoint5 waypoint4)
    (can_traverse rover4 waypoint7 waypoint3)
    (can_traverse rover4 waypoint9 waypoint5)
    (can_traverse rover4 waypoint8 waypoint3)
    (can_traverse rover4 waypoint4 waypoint5)
    (can_traverse rover4 waypoint10 waypoint6)
    (can_traverse rover4 waypoint6 waypoint10)
    (can_traverse rover4 waypoint2 waypoint6)
    (can_traverse rover4 waypoint5 waypoint3)
    (can_traverse rover4 waypoint5 waypoint9)
    (can_traverse rover4 waypoint1 waypoint3)
    (can_traverse rover4 waypoint3 waypoint5)
    (can_traverse rover4 waypoint3 waypoint9)
    (can_traverse rover4 waypoint9 waypoint3)
    (can_traverse rover4 waypoint5 waypoint10)
    (can_traverse rover4 waypoint10 waypoint5)
    (can_traverse rover4 waypoint8 waypoint10)
    (can_traverse rover4 waypoint10 waypoint8)
    (can_traverse rover4 waypoint3 waypoint10)
    (can_traverse rover4 waypoint10 waypoint3)
    (can_traverse rover4 waypoint1 waypoint8)
    (can_traverse rover4 waypoint8 waypoint1)
    (can_traverse rover4 waypoint4 waypoint8)
    (can_traverse rover4 waypoint8 waypoint4)
    (can_traverse rover4 waypoint1 waypoint2)
    (can_traverse rover4 waypoint2 waypoint1)
    (can_traverse rover4 waypoint2 waypoint7)
    (can_traverse rover4 waypoint7 waypoint2)
    (can_traverse rover4 waypoint4 waypoint9)
    (can_traverse rover4 waypoint9 waypoint4)
    (can_traverse rover4 waypoint7 waypoint9)
    (can_traverse rover4 waypoint9 waypoint7)
    (calibration_target camera1 objective9)
    (on_board camera1 rover4)
    (supports camera1 low_res)
    (calibration_target camera2 objective8)
    (on_board camera2 rover3)
    (supports camera2 colour)
    (calibration_target camera3 objective9)
    (on_board camera3 rover3)
    (supports camera3 low_res)
    (supports camera3 colour)
    (calibration_target camera4 objective10)
    (on_board camera4 rover4)
    (supports camera4 low_res)
    (supports camera3 high_res)
    (supports camera4 high_res)
    (visible_from objective1 waypoint5)
    (visible_from objective1 waypoint10)
    (visible_from objective1 waypoint3)
    (visible_from objective1 waypoint1)
    (visible_from objective1 waypoint2)
    (visible_from objective2 waypoint3)
    (visible_from objective2 waypoint10)
    (visible_from objective2 waypoint7)
    (visible_from objective2 waypoint2)
    (visible_from objective2 waypoint5)
    (visible_from objective2 waypoint4)
    (visible_from objective2 waypoint1)
    (visible_from objective2 waypoint6)
    (visible_from objective2 waypoint8)
    (visible_from objective2 waypoint9)
    (visible_from objective3 waypoint3)
    (visible_from objective3 waypoint2)
    (visible_from objective3 waypoint6)
    (visible_from objective4 waypoint9)
    (visible_from objective4 waypoint8)
    (visible_from objective4 waypoint5)
    (visible_from objective4 waypoint10)
    (visible_from objective4 waypoint6)
    (visible_from objective4 waypoint7)
    (visible_from objective4 waypoint4)
    (visible_from objective4 waypoint1)
    (visible_from objective4 waypoint3)
    (visible_from objective5 waypoint4)
    (visible_from objective5 waypoint3)
    (visible_from objective5 waypoint9)
    (visible_from objective5 waypoint10)
    (visible_from objective5 waypoint6)
    (visible_from objective6 waypoint3)
    (visible_from objective6 waypoint5)
    (visible_from objective6 waypoint2)
    (visible_from objective7 waypoint5)
    (visible_from objective7 waypoint10)
    (visible_from objective7 waypoint6)
    (visible_from objective7 waypoint1)
    (visible_from objective7 waypoint9)
    (visible_from objective7 waypoint4)
    (visible_from objective7 waypoint7)
    (visible_from objective7 waypoint2)
    (visible_from objective7 waypoint8)
    (visible_from objective7 waypoint3)
    (visible_from objective8 waypoint7)
    (visible_from objective8 waypoint5)
    (visible_from objective8 waypoint1)
    (visible_from objective8 waypoint10)
    (visible_from objective8 waypoint9)
    (visible_from objective8 waypoint6)
    (visible_from objective8 waypoint4)
    (visible_from objective8 waypoint2)
    (visible_from objective8 waypoint3)
    (visible_from objective8 waypoint8)
    (visible_from objective9 waypoint2)
    (visible_from objective9 waypoint10)
    (visible_from objective9 waypoint9)
    (visible_from objective9 waypoint8)
    (visible_from objective9 waypoint3)
    (visible_from objective9 waypoint5)
    (visible_from objective10 waypoint4)
    (visible_from objective10 waypoint10)
    (visible_from objective10 waypoint5)
    (visible_from objective10 waypoint2))
 (:goal  (and 
    
    (communicated_soil_data waypoint2)
    (communicated_soil_data waypoint4)
    (communicated_soil_data waypoint1)
    (communicated_soil_data waypoint9)
    (communicated_image_data objective4 low_res)
    (communicated_image_data objective8 low_res)
    (communicated_image_data objective10 high_res)
    (communicated_image_data objective6 low_res)
    (communicated_image_data objective4 high_res)
    (communicated_image_data objective1 high_res)
    (communicated_image_data objective7 high_res)
    (communicated_image_data objective3 colour)
    (communicated_image_data objective7 colour)
    (communicated_image_data objective9 high_res)
    (communicated_image_data objective3 high_res)
    (communicated_image_data objective7 low_res)
    (communicated_image_data objective6 colour)
    (communicated_image_data objective2 low_res)
    (communicated_image_data objective5 high_res)
    (communicated_image_data objective2 high_res)
    (communicated_image_data objective1 low_res))))

; plan
1. (navigate rover4 waypoint8 waypoint1)
   deleted: (at rover4 waypoint8)
   added: (at rover4 waypoint1)
   goals met: 0 of 21
2. (navigate rover4 waypoint1 waypoint2)
   deleted: (at rover4 waypoint1)
   added: (at rover4 waypoint2)
   goals met: 0 of 21
3. (sample_soil rover4 rover4store waypoint2)
   deleted: (empty rover4store) (at_soil_sample waypoint2)
   added: (full rover4store) (have_soil_analysis rover4 waypoint2)
   goals met: 0 of 21
4. (drop rover4 rover4store)
   deleted: (full rover4store)
   added: (empty rover4store)
   goals met: 0 of 21
5. (communicate_soil_data rover4 general waypoint2 waypoint2 waypoint10)
   added: (communicated_soil_data waypoint2)
   goals met: 1 of 21
6. (navigate rover4 waypoint2 waypoint7)
   deleted: (at rover4 waypoint2)
   added: (at rover4 waypoint7)
   goals met: 1 of 21
7. (navigate rover4 waypoint7 waypoint9)
   deleted: (at rover4 waypoint7)
   added: (at rover4 waypoint9)
   goals met: 1 of 21
8. (navigate rover4 waypoint9 waypoint4)
   deleted: (at rover4 waypoint9)
   added: (at rover4 waypoint4)
   goals met: 1 of 21
9. (sample_soil rover4 rover4store waypoint4)
   deleted: (empty rover4store) (at_soil_sample waypoint4)
   added: (full rover4store) (have_soil_analysis rover4 waypoint4)
   goals met: 1 of 21
10. (drop rover4 rover4store)
   deleted: (full rover4store)
   added: (empty rover4store)
   goals met: 1 of 21
11. (communicate_soil_data rover4 general waypoint4 waypoint4 waypoint10)
   added: (communicated_soil_data waypoint4)
   goals met: 2 of 21
12. (navigate rover4 waypoint4 waypoint8)
   deleted: (at rover4 waypoint4)
   added: (at rover4 waypoint8)
   goals met: 2 of 21
13. (navigate rover4 waypoint8 waypoint1)
   deleted: (at rover4 waypoint8)
   added: (at rover4 waypoint1)
   goals met: 2 of 21
14. (sample_soil rover4 rover4store waypoint1)
   deleted: (empty rover4store) (at_soil_sample waypoint1)
   added: (full rover4store) (have_soil_analysis rover4 waypoint1)
   goals met: 2 of 21
15. (drop rover4 rover4store)
   deleted: (full rover4store)
   added: (empty rover4store)
   goals met: 2 of 21
16. (communicate_soil_data rover4 general waypoint1 waypoint1 waypoint10)
   added: (communicated_soil_data waypoint1)
   goals met: 3 of 21
17. (navigate rover4 waypoint1 waypoint3)
   deleted: (at rover4 waypoint1)
   added: (at rover4 waypoint3)
   goals met: 3 of 21
18. (navigate rover4 waypoint3 waypoint9)
   deleted: (at rover4 waypoint3)
   added: (at rover4 waypoint9)
   goals met: 3 of 21
19. (sample_soil rover4 rover4store waypoint9)
   deleted: (empty rover4store) (at_soil_sample waypoint9)
   added: (full rover4store) (have_soil_analysis rover4 waypoint9)
   goals met: 3 of 21
20. (drop rover4 rover4store)
   deleted: (full rover4store)
   added: (empty rover4store)
   goals met: 3 of 21
21. (communicate_soil_data rover4 general waypoint9 waypoint9 waypoint10)
   added: (communicated_soil_data waypoint9)
   goals met: 4 of 21
22. (calibrate rover4 camera1 objective9 waypoint9)
   added: (calibrated camera1 rover4)
   goals met: 4 of 21
23. (take_image rover4 waypoint9 objective4 camera1 low_res)
   deleted: (calibrated camera1 rover4)
   added: (have_image rover4 objective4 low_res)
   goals met: 4 of 21
24. (communicate_image_data rover4 general objective4 low_res waypoint9 waypoint10)
   added: (communicated_image_data objective4 low_res)
   goals met: 5 of 21
25. (calibrate rover4 camera1 objective9 waypoint9)
   added: (calibrated camera1 rover4)
   goals met: 5 of 21
26. (take_image rover4 waypoint9 objective8 camera1 low_res)
   deleted: (calibrated camera1 rover4)
   added: (have_image rover4 objective8 low_res)
   goals met: 5 of 21
27. (communicate_image_data rover4 general objective8 low_res waypoint9 waypoint10)
   added: (communicated_image_data objective8 low_res)
   goals met: 6 of 21
28. (navigate rover4 waypoint9 waypoint4)
   deleted: (at rover4 waypoint9)
   added: (at rover4 waypoint4)
   goals met: 6 of 21
29. (calibrate rover4 camera4 objective10 waypoint4)
   added: (calibrated camera4 rover4)
   goals met: 6 of 21
30. (take_image rover4 waypoint4 objective10 camera4 high_res)
   deleted: (calibrated camera4 rover4)
   added: (have_image rover4 objective10 high_res)
   goals met: 6 of 21
31. (communicate_image_data rover4 general objective10 high_res waypoint4 waypoint10)
   added: (communicated_image_data objective10 high_res)
   goals met: 7 of 21
32. (navigate rover4 waypoint4 waypoint5)
   deleted: (at rover4 waypoint4)
   added: (at rover4 waypoint5)
   goals met: 7 of 21
33. (calibrate rover4 camera1 objective9 waypoint5)
   added: (calibrated camera1 rover4)
   goals met: 7 of 21
34. (take_image rover4 waypoint5 objective6 camera1 low_res)
   deleted: (calibrated camera1 rover4)
   added: (have_image rover4 objective6 low_res)
   goals met: 7 of 21
35. (communicate_image_data rover4 general objective6 low_res waypoint5 waypoint10)
   added: (communicated_image_data objective6 low_res)
   goals met: 8 of 21
36. (calibrate rover4 camera4 objective10 waypoint5)
   added: (calibrated camera4 rover4)
   goals met: 8 of 21
37. (take_image rover4 waypoint5 objective4 camera4 high_res)
   deleted: (calibrated camera4 rover4)
   added: (have_image rover4 objective4 high_res)
   goals met: 8 of 21
38. (communicate_image_data rover4 general objective4 high_res waypoint5 waypoint10)
   added: (communicated_image_data objective4 high_res)
   goals met: 9 of 21
39. (calibrate rover4 camera4 objective10 waypoint5)
   added: (calibrated camera4 rover4)
   goals met: 9 of 21
40. (take_image rover4 waypoint5 objective1 camera4 high_res)
   deleted: (calibrated camera4 rover4)
   added: (have_image rover4 objective1 high_res)
   goals met: 9 of 21
41. (communicate_image_data rover4 general objective1 high_res waypoint5 waypoint10)
   added: (communicated_image_data objective1 high_res)
   goals met: 10 of 21
42. (calibrate rover4 camera4 objective10 waypoint5)
   added: (calibrated camera4 rover4)
   goals met: 10 of 21
43. (take_image rover4 waypoint5 objective7 camera4 high_res)
   deleted: (calibrated camera4 rover4)
   added: (have_image rover4 objective7 high_res)
   goals met: 10 of 21
44. (communicate_image_data rover4 general objective7 high_res waypoint5 waypoint10)
   added: (communicated_image_data objective7 high_res)
   goals met: 11 of 21
45. (calibrate rover3 camera3 objective9 waypoint10)
   added: (calibrated camera3 rover3)
   goals met: 11 of 21
46. (navigate rover3 waypoint10 waypoint2)
   deleted: (at rover3 waypoint10)
   added: (at rover3 waypoint2)
   goals met: 11 of 21
47. (take_image rover3 waypoint2 objective3 camera3 colour)
   deleted: (calibrated camera3 rover3)
   added: (have_image rover3 objective3 colour)
   goals met: 11 of 21
48. (communicate_image_data rover3 general objective3 colour waypoint2 waypoint10)
   added: (communicated_image_data objective3 colour)
   goals met: 12 of 21
49. (calibrate rover3 camera3 objective9 waypoint2)
   added: (calibrated camera3 rover3)
   goals met: 12 of 21
50. (take_image rover3 waypoint2 objective7 camera3 colour)
   deleted: (calibrated camera3 rover3)
   added: (have_image rover3 objective7 colour)
   goals met: 12 of 21
51. (communicate_image_data rover3 general objective7 colour waypoint2 waypoint10)
   added: (communicated_image_data objective7 colour)
   goals met: 13 of 21
52. (calibrate rover4 camera4 objective10 waypoint5)
   added: (calibrated camera4 rover4)
   goals met: 13 of 21
53. (take_image rover4 waypoint5 objective9 camera4 high_res)
   deleted: (calibrated camera4 rover4)
   added: (have_image rover4 objective9 high_res)
   goals met: 13 of 21
54. (communicate_image_data rover4 general objective9 high_res waypoint5 waypoint10)
   added: (communicated_image_data objective9 high_res)
   goals met: 14 of 21
55. (calibrate rover4 camera4 objective10 waypoint5)
   added: (calibrated camera4 rover4)
   goals met: 14 of 21
56. (navigate rover4 waypoint5 waypoint3)
   deleted: (at rover4 waypoint5)
   added: (at rover4 waypoint3)
   goals met: 14 of 21
57. (take_image rover4 waypoint3 objective3 camera4 high_res)
   deleted: (calibrated camera4 rover4)
   added: (have_image rover4 objective3 high_res)
   goals met: 14 of 21
58. (communicate_image_data rover4 general objective3 high_res waypoint3 waypoint10)
   added: (communicated_image_data objective3 high_res)
   goals met: 15 of 21
59. (calibrate rover4 camera1 objective9 waypoint3)
   added: (calibrated camera1 rover4)
   goals met: 15 of 21
60. (take_image rover4 waypoint3 objective7 camera1 low_res)
   deleted: (calibrated camera1 rover4)
   added: (have_image rover4 objective7 low_res)
   goals met: 15 of 21
61. (communicate_image_data rover4 general objective7 low_res waypoint3 waypoint10)
   added: (communicated_image_data objective7 low_res)
   goals met: 16 of 21
62. (calibrate rover3 camera3 objective9 waypoint2)
   added: (calibrated camera3 rover3)
   goals met: 16 of 21
63. (take_image rover3 waypoint2 objective6 camera3 colour)
   deleted: (calibrated camera3 rover3)
   added: (have_image rover3 objective6 colour)
   goals met: 16 of 21
64. (communicate_image_data rover3 general objective6 colour waypoint2 waypoint10)
   added: (communicated_image_data objective6 colour)
   goals met: 17 of 21
65. (calibrate rover4 camera1 objective9 waypoint3)
   added: (calibrated camera1 rover4)
   goals met: 17 of 21
66. (take_image rover4 waypoint3 objective2 camera1 low_res)
   deleted: (calibrated camera1 rover4)
   added: (have_image rover4 objective2 low_res)
   goals met: 17 of 21
67. (communicate_image_data rover4 general objective2 low_res waypoint3 waypoint10)
   added: (communicated_image_data objective2 low_res)
   goals met: 18 of 21
68. (navigate rover4 waypoint3 waypoint10)
   deleted: (at rover4 waypoint3)
   added: (at rover4 waypoint10)
   goals met: 18 of 21
69. (calibrate rover4 camera4 objective10 waypoint10)
   added: (calibrated camera4 rover4)
   goals met: 18 of 21
70. (take_image rover4 waypoint10 objective5 camera4 high_res)
   deleted: (calibrated camera4 rover4)
   added: (have_image rover4 objective5 high_res)
   goals met: 18 of 21
71. (navigate rover4 waypoint10 waypoint9)
   deleted: (at rover4 waypoint10)
   added: (at rover4 waypoint9)
   goals met: 18 of 21
72. (communicate_image_data rover4 general objective5 high_res waypoint9 waypoint10)
   added: (communicated_image_data objective5 high_res)
   goals met: 19 of 21
73. (navigate rover4 waypoint9 waypoint4)
   deleted: (at rover4 waypoint9)
   added: (at rover4 waypoint4)
   goals met: 19 of 21
74. (calibrate rover4 camera4 objective10 waypoint4)
   added: (calibrated camera4 rover4)
   goals met: 19 of 21
75. (take_image rover4 waypoint4 objective2 camera4 high_res)
   deleted: (calibrated camera4 rover4)
   added: (have_image rover4 objective2 high_res)
   goals met: 19 of 21
76. (communicate_image_data rover4 general objective2 high_res waypoint4 waypoint10)
   added: (communicated_image_data objective2 high_res)
   goals met: 20 of 21
77. (navigate rover4 waypoint4 waypoint5)
   deleted: (at rover4 waypoint4)
   added: (at rover4 waypoint5)
   goals met: 20 of 21
78. (calibrate rover4 camera1 objective9 waypoint5)
   added: (calibrated camera1 rover4)
   goals met: 20 of 21
79. (take_image rover4 waypoint5 objective1 camera1 low_res)
   deleted: (calibrated camera1 rover4)
   added: (have_image rover4 objective1 low_res)
   goals met: 20 of 21
80. (communicate_image_data rover4 general objective1 low_res waypoint5 waypoint10)
   added: (communicated_image_data objective1 low_res)
   goals met: 21 of 21
